[

    {
    "id": 1,
    "title": "Tuono 457",   
    "category": "Street",   
    "brand": "Aprilia",      
    "imageUrl": "https://placehold.co/450x350?text=Bike+Img",
    "description": "Tuono 457 is pure adrenaline. The throttle that unleashes your truest emotions, thanks to unbeatable dynamism, rebellious styling and top technology. Aprilia Tuono 457 is a true naked bike that retains the essential values characteristic of the funbike par excellence, Aprilia Tuono. With the best power-to-weight ratio that can be ridden with an A2 license, it is designed for a new movement of passionate and competent young riders like you, who demand absolute performance and pure fun.",
    "engine": 400,    
    "speed": 160,      
    "power": 47,      
    "weight": 159,   
    "price": 6599,      
    "color": ["Piranha Red", "Puma Gray"],    
    "optional": false     
    },
    {
    "id": 2,
    "title": "RS 660",      
    "category": "Sporting",   
    "brand": "Aprilia",      
    "imageUrl": "https://placehold.co/450x350?text=Bike+Img",  
    "description": "Aprilia RS 660 is the benchmark of the new generation of lightweight, performance motorcycles, a segment she created to embody your new idea of sportiness. Discover the perfect balance of power, lightness, and advanced technology, confirmed by the successes that the RS 660 wins in all the championships in which it is engaged. The RS 660's performance is absolute on the road and on the track, thanks to its powerful Euro 5+ twin-cylinder engine, racing aerodynamics with winglets, and advanced APRC package.",
    "engine": 600,     
    "speed": 190,      
    "power": 105,      
    "weight": 183,    
    "price": 11799,      
    "color": ["Yellow Venom", "Marlin Blue"],   
    "optional": true     
    },
    {
    "id": 3,
    "title": "Africa Twin",      
    "category": "Crossover",   
    "brand": "Honda",      
    "imageUrl": "https://placehold.co/450x350?text=Bike+Img",  
    "description": "And the new Africa Twin Adventure Sports is ready to live it, thanks to the increased torque available that gives even grittier acceleration. Plus, to make the most of the ample range the 24.8-liter tank gives, the new fairing and redesigned windshield offer more protection from wind and weather, ensuring maximum comfort even after many hours in the saddle. Simply the perfect bike to satisfy your desire for adventure.",
    "engine": 1100,     
    "speed": 200,    
    "power": 105,
    "weight": 230,    
    "price": 15390,      
    "color": ["Black Metallic","Gran Prix Red"],   
    "optional": true     
    },
    {
    "id": 4,
    "title": "Duke 990",
    "category": "Street",   
    "brand": "Ktm",      
    "imageUrl": "https://placehold.co/450x350?text=Bike+Img",  
    "description": "Capable of hitting any target with devastating accuracy, the all-new KTM 990 DUKE brings unparalleled levels of precision to the road. With 123 hp and 103 Nm packed into a completely new chassis, adjustable WP APEX suspension and highly optimized electronics, this is - in a nutshell - the lightest, most precise and performance-oriented NAKED middle-class bike among those equipped with the DUKE nameplate.",
    "engine": 900,     
    "speed": 240,    
    "power": 123,
    "weight": 179,    
    "price": 12990,      
    "color": ["Phanton Black","Elettronic Orange"],   
    "optional": false     
    },
    {
    "id": 5,
    "title": "RSV4",      
    "category": "Sporting",   
    "brand": "Aprilia",      
    "imageUrl": "https://placehold.co/450x350?text=Bike+Img",  
    "description": "The Aprilia RSV4 is the ultimate sports bike, the result of years of experience and innovation by the Aprilia Racing Department in MotoGP. Designed to push the limits of motorcycle engineering, it brings together world-class equipment, the finest a-PRC (Aprilia Performance Ride Control) electronics and the power of 220 hp. The track is its realm and it is ready to exercise absolute dominance.",
    "engine": 1100,     
    "speed": 300,    
    "power": 217,
    "weight": 202,    
    "price": 20999,      
    "color": ["Poison Yellow ","Stingray Blue"],   
    "optional": true     
    },
    {
    "id": 6,
    "title": "CBR600RR",      
    "category": "Sporting",   
    "brand": "Honda",      
    "imageUrl": "https://placehold.co/450x350?text=Bike+Img",  
    "description": "And the new CBR600RR is ready to live it, thanks to the increased torque available that gives even grittier acceleration.",
    "engine": 600,     
    "speed": 265,      
    "power": 121,      
    "weight": 193,    
    "price": 12190,      
    "color": ["Black Metallic","Gran Prix Red"],   
    "optional": true     
    },
    {
    "id": 7,
    "title": "CB750",      
    "category": "Street",   
    "brand": "Honda",      
    "imageUrl": "https://placehold.co/450x350?text=Bike+Img",  
    "description": "And the new CBR600RR is ready to live it, thanks to the increased torque available that gives even grittier acceleration.",
    "engine": 1100,     
    "speed": 300,    
    "power": 217,
    "weight": 202,    
    "price": 20999,      
    "color": ["Poison Yellow ","Stingray Blue"],   
    "optional": true     
    },
    {
    "id": 8,
    "title": "Duke 390",      
    "category": "Sporting",   
    "brand": "Ktm",      
    "imageUrl": "https://placehold.co/450x350?text=Bike+Img",  
    "description": "Born between the curbs, unbeatable on the road. The new CBR600RR is a pure supersport, developed thanks to the know-how of the HRC Racing Department, equipped with a formidable inline one-cylinder engine and a solid, ultra-handling chassis.",
    "engine": 400,     
    "speed": 170,    
    "power": 44,
    "weight": 156,    
    "price": 7900,      
    "color": ["Phanton Black","Elettronic Orange"],   
    "optional": false     
    },
    {
    "id": 9,
    "title": "790ADV",      
    "category": "Crossover",   
    "brand": "Ktm",      
    "imageUrl": "https://placehold.co/450x350?text=Bike+Img",  
    "description": "Capable of hitting any target with devastating accuracy, the all-new 790 ADV brings unparalleled levels of precision to the road. With 123 hp and 103 Nm packed into a completely new chassis, adjustable WP APEX suspension and highly optimized electronics, this is - in a nutshell - the lightest, most precise and performance-oriented NAKED middle-class bike among those equipped with the DUKE nameplate.",
    "engine": 800,     
    "speed": 210,    
    "power": 200,
    "weight": 202,    
    "price": 18999,      
    "color": ["Phanton Black","Elettronic Orange"],   
    "optional": true     
    },
    {
    "id": 10,
    "title": "1290ADV",      
    "category": "Crossover",   
    "brand": "Ktm",      
    "imageUrl": "https://placehold.co/450x350?text=Bike+Img",  
    "description": "Born between the curbs, unbeatable on the road. The new 1290 ADV is a pure supersport, developed thanks to the know-how of the HRC Racing Department, equipped with a formidable inline dual-cylinder engine and a solid, ultra-handling chassis.",
    "engine": 1300,     
    "speed": 250,    
    "power": 217,
    "weight": 242,    
    "price": 21999,      
    "color": ["Phanton Black","Elettronic Orange"],   
    "optional": true     
    }
]